IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_INTAGGR_0_INTAGGR_UNMAP.xml
<module name="DMASS0_INTAGGR_0_INTAGGR_UNMAP" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x0" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x8000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x9000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0xA000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0xB000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0xC000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0xD000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x10000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x11000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x12000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x13000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x14000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x15000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x16000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x17000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="INTAGGR_UNMAP_map" acronym="INTAGGR_UNMAP_map" offset="0x18000" width="64" description="The Global Event Mapping register controls the egress global event index for this unmapped event. This register may also be optionally used to directly set an interrupt status bit by using the irqmode flag.">
		<bitfield id="IRQMODE" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="UMAPIDX" width="16" begin="15" end="0" resetval="0x65535" description="Global event index.  This field specifies the index of the outgoing global event. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
</module>